TMH_Tester_JUnit1/TestPack/input/Regression_Testing_15.2/SS15/FCM/Trigger/RollTriggerReq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:get="http://www.lloydstsb.com/Schema/AccountingHub/getTriggerControl">
<soapenv:Header/>
<soapenv:Body>
<get:GetTriggerControlRequest>
<get:RequestId>2002201801</get:RequestId>
<get:SourceSystem>IPSL</get:SourceSystem>
<get:TriggerType>ROLL</get:TriggerType>
<get:TriggerTimeStamp>2018-03-20T05:28:36</get:TriggerTimeStamp>
<get:EventDate>2018-03-20</get:EventDate>
<get:PaymentScheme>ICS</get:PaymentScheme>
<get:IsReTrigger>false</get:IsReTrigger>
<get:Info>NULL</get:Info>
</get:GetTriggerControlRequest>
</soapenv:Body>
</soapenv:Envelope>